Revit 2024 API
FamilyManager.RenameParameter Method
Rename a family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RenameParameter(
	FamilyParameter familyParameter,
	string name
)
Visual Basic
Public Sub RenameParameter ( _
	familyParameter As FamilyParameter, _
	name As String _
)
Visual C++
public:
void RenameParameter(
	FamilyParameter^ familyParameter,
	String^ name
)
Parameters
familyParameter
Type: Autodesk.Revit.DB.FamilyParameter
The family parameter.
name
Type: System.String
The new name.
Remarks
This operation is valid only for Family Parameters, and is invalid for Shared Parameters and Built-in Parameters.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-"familyParameter" or "name"-is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input argument-"familyParameter"-is invalid, or the input name string contains illegal characters, or duplicated with existing parameter name.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when trying to rename a built-in parameter or shared parameter.
See Also
FamilyManager Class
Autodesk.Revit.DB Namespace